### YamlMime:AzureCLIGroup
uid: ext_log-analytics_az_monitor_log_analytics
name: az monitor log-analytics
extensionInformation: >-
  > [!Note]

  > Cette référence fait partie de l’extension **log-Analytics** pour Azure CLI et requiert la version 2.0.0 ou une version ultérieure.  L’extension est automatiquement installée la première fois que vous exécutez une commande **AZ Monitor log-Analytics** .  [Apprenez-en davantage](https://docs.microsoft.com/en-us/cli/azure/azure-cli-extensions-overview) sur les extensions.
summary: Commandes permettant d’interroger les données dans des espaces de travail Log Analytics.
description: ''
directCommands:
- uid: ext_log-analytics_az_monitor_log_analytics_query
  name: az monitor log-analytics query
  summary: Interrogez un espace de travail Log Analytics.
  description: ''
  syntax: >-
    az monitor log-analytics query --analytics-query
                                   --workspace
                                   [--timespan]
                                   [--workspaces]
  examples:
  - summary: Exécutez une requête simple au cours des 3,5 derniers jours.
    syntax: az monitor log-analytics query -w workspace-customId --analytics-query "AzureActivity | summarize count() by bin(timestamp, 1h)" -t P3DT12H
  - summary: Exécuter une requête enregistrée dans l’espace de travail
    syntax: >-
      QUERY=$(az monitor log-analytics workspace saved-search show -g resource-group --workspace-name workspace-name -n query-name --query query --output tsv)

      az monitor log-analytics query -w workspace-customId --analytics-query "$QUERY"
  requiredParameters:
  - isRequired: true
    name: --analytics-query
    summary: Requête à exécuter sur Log Analytics données.
    description: ''
  - isRequired: true
    name: --workspace -w
    summary: GUID de l’espace de travail Log Analytics.
    description: ''
  optionalParameters:
  - name: --timespan -t
    summary: Intervalle de temps à interroger. La valeur par défaut est l’interrogation de toutes les données disponibles.
    description: ''
  - name: --workspaces
    summary: Espaces de travail supplémentaires pour l’interrogation des données. Spécifiez des ID d’espace de travail supplémentaires séparés par un espace.
    description: ''
commands:
- ext_log-analytics_az_monitor_log_analytics_query
globalParameters:
- name: --debug
  summary: Augmentez le niveau de détail de la journalisation pour afficher tous les journaux de débogage.
- name: --help -h
  summary: Affichez ce message d’aide et quittez.
- name: --only-show-errors
  summary: Afficher uniquement les erreurs, en supprimant les avertissements.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Format de sortie.
- name: --query
  summary: Chaîne de requêtes JMESPath. Pour obtenir plus d’informations et des exemples, consultez <a href="http://jmespath.org/">http://jmespath.org/</a>.
- name: --verbose
  summary: Augmentez le niveau de détail de la journalisation. Utilisez --debug pour des journaux de débogage complets.
metadata:
  description: Commandes permettant d’interroger les données dans des espaces de travail Log Analytics.
  ms.openlocfilehash: 5b96adf598bf72e955ea1fae9d2662258ecdc62c
  ms.sourcegitcommit: 2a0ae2ffc14ce325f9adb9c09d6b5eac534df8a6
  ms.translationtype: MT
  ms.contentlocale: fr-FR
  ms.lasthandoff: 01/27/2021
  ms.locfileid: "102844936"
