### YamlMime:AzureCLIGroup
uid: az_sentinel_bookmark
name: az sentinel bookmark
extensionInformation: >-
  > [!Note]

  > Cette référence fait partie de l’extension **Sentinel** pour Azure CLI et requiert la version 2.11.0 ou ultérieure.  L’extension est automatiquement installée la première fois que vous exécutez une commande **AZ Sentinel Bookmark** .  [Apprenez-en davantage](https://docs.microsoft.com/en-us/cli/azure/azure-cli-extensions-overview) sur les extensions.
summary: Signet Sentinel.
description: ''
directCommands:
- uid: az_sentinel_bookmark_create
  name: az sentinel bookmark create
  summary: Créez le signet.
  description: ''
  syntax: >-
    az sentinel bookmark create --bookmark-id
                                --resource-group
                                --workspace-name
                                [--created]
                                [--display-name]
                                [--etag]
                                [--incident-info]
                                [--labels]
                                [--notes]
                                [--query-result]
                                [--updated]
                                [--updated-by-object-id]
                                [-q]
  examples:
  - summary: Crée ou met à jour un signet.
    syntax: az sentinel bookmark create --etag "{etag}" --created "2019-01-01T13:15:30Z" --display-name "My bookmark" --labels "Tag1" --labels "Tag2" --notes "Found a suspicious activity" -q "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)" --query-result "Security Event query result" --updated "2019-01-01T13:15:30Z" --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: ID de signet.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nom du groupe de ressources. Vous pouvez configurer le groupe par défaut en utilisant `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nom de l’espace de travail.
    description: ''
  optionalParameters:
  - name: --created
    summary: Heure à laquelle le signet a été créé.
    description: ''
  - name: --display-name
    summary: Nom complet du signet.
    description: ''
  - name: --etag
    summary: ETag de la ressource Azure.
    description: ''
  - name: --incident-info
    summary: Décrit un incident lié au signet.
    description: >-
      Utilisation :--incident-informations incident-ID = XX Severity = XX title = XX relation-Name = XX


      ID d’incident : obligatoire. Gravité de l’ID d’incident : obligatoire. Gravité du titre de l’incident : obligatoire. Titre de la relation d’incident-nom : obligatoire. Nom de la relation.
  - name: --labels
    summary: Liste des étiquettes pertinentes pour ce signet.
    description: ''
  - name: --notes
    summary: Remarques du signet.
    description: ''
  - name: --query-result
    summary: Résultat de la requête du signet.
    description: ''
  - name: --updated
    summary: Heure de la dernière mise à jour du signet.
    description: ''
  - name: --updated-by-object-id
    summary: ID d’objet de l’utilisateur.
    description: ''
  - name: -q
    summary: Requête du signet.
    description: ''
- uid: az_sentinel_bookmark_delete
  name: az sentinel bookmark delete
  summary: Supprimez le signet.
  description: ''
  syntax: >-
    az sentinel bookmark delete --bookmark-id
                                --resource-group
                                --workspace-name
                                [--yes]
  examples:
  - summary: Supprimer un signet.
    syntax: az sentinel bookmark delete --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: ID de signet.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nom du groupe de ressources. Vous pouvez configurer le groupe par défaut en utilisant `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nom de l’espace de travail.
    description: ''
  optionalParameters:
  - name: --yes -y
    summary: Ne pas demander de confirmation.
    description: ''
- uid: az_sentinel_bookmark_list
  name: az sentinel bookmark list
  summary: Obtient tous les signets.
  description: ''
  syntax: >-
    az sentinel bookmark list --resource-group
                              --workspace-name
  examples:
  - summary: Obtient tous les signets.
    syntax: az sentinel bookmark list --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --resource-group -g
    summary: Nom du groupe de ressources. Vous pouvez configurer le groupe par défaut en utilisant `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nom de l’espace de travail.
    description: ''
- uid: az_sentinel_bookmark_show
  name: az sentinel bookmark show
  summary: Obtient un signet.
  description: ''
  syntax: >-
    az sentinel bookmark show --bookmark-id
                              --resource-group
                              --workspace-name
  examples:
  - summary: Obtient un signet.
    syntax: az sentinel bookmark show --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: ID de signet.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nom du groupe de ressources. Vous pouvez configurer le groupe par défaut en utilisant `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nom de l’espace de travail.
    description: ''
- uid: az_sentinel_bookmark_update
  name: az sentinel bookmark update
  summary: Mettez à jour le signet.
  description: ''
  syntax: >-
    az sentinel bookmark update --bookmark-id
                                --resource-group
                                --workspace-name
                                [--created]
                                [--display-name]
                                [--etag]
                                [--incident-info]
                                [--labels]
                                [--notes]
                                [--query-result]
                                [--updated]
                                [--updated-by-object-id]
                                [-q]
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: ID de signet.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nom du groupe de ressources. Vous pouvez configurer le groupe par défaut en utilisant `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nom de l’espace de travail.
    description: ''
  optionalParameters:
  - name: --created
    summary: Heure à laquelle le signet a été créé.
    description: ''
  - name: --display-name
    summary: Nom complet du signet.
    description: ''
  - name: --etag
    summary: ETag de la ressource Azure.
    description: ''
  - name: --incident-info
    summary: Décrit un incident lié au signet.
    description: >-
      Utilisation :--incident-informations incident-ID = XX Severity = XX title = XX relation-Name = XX


      ID d’incident : obligatoire. Gravité de l’ID d’incident : obligatoire. Gravité du titre de l’incident : obligatoire. Titre de la relation d’incident-nom : obligatoire. Nom de la relation.
  - name: --labels
    summary: Liste des étiquettes pertinentes pour ce signet.
    description: ''
  - name: --notes
    summary: Remarques du signet.
    description: ''
  - name: --query-result
    summary: Résultat de la requête du signet.
    description: ''
  - name: --updated
    summary: Heure de la dernière mise à jour du signet.
    description: ''
  - name: --updated-by-object-id
    summary: ID d’objet de l’utilisateur.
    description: ''
  - name: -q
    summary: Requête du signet.
    description: ''
commands:
- az_sentinel_bookmark_create
- az_sentinel_bookmark_delete
- az_sentinel_bookmark_list
- az_sentinel_bookmark_show
- az_sentinel_bookmark_update
globalParameters:
- name: --debug
  summary: Augmentez le niveau de détail de la journalisation pour afficher tous les journaux de débogage.
- name: --help -h
  summary: Affichez ce message d’aide et quittez.
- name: --only-show-errors
  summary: Afficher uniquement les erreurs, en supprimant les avertissements.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Format de sortie.
- name: --query
  summary: Chaîne de requêtes JMESPath. Pour obtenir plus d’informations et des exemples, consultez <a href="http://jmespath.org/">http://jmespath.org/</a>.
- name: --verbose
  summary: Augmentez le niveau de détail de la journalisation. Utilisez --debug pour des journaux de débogage complets.
metadata:
  description: Signet Sentinel.
  ms.openlocfilehash: c6825b3b0fd8c45758090ea3bb6e03229a33f427
  ms.sourcegitcommit: 612554c029ba1f28d3a43fd22e743104a1a30ea0
  ms.translationtype: MT
  ms.contentlocale: fr-FR
  ms.lasthandoff: 04/07/2021
  ms.locfileid: "106908059"
